-- --------------------------------------------------------
-- 主机:                           127.0.0.1
-- 服务器版本:                        5.5.53-log - MySQL Community Server (GPL)
-- 服务器操作系统:                      Win32
-- HeidiSQL 版本:                  9.5.0.5220
-- --------------------------------------------------------

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET NAMES utf8 */;
/*!50503 SET NAMES utf8mb4 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;


-- 导出 youban 的数据库结构
CREATE DATABASE IF NOT EXISTS `youban` /*!40100 DEFAULT CHARACTER SET utf8 */;
USE `youban`;

-- 导出  表 youban.admin 结构
CREATE TABLE IF NOT EXISTS `admin` (
  `aid` int(11) NOT NULL AUTO_INCREMENT COMMENT 'admin表主键',
  `adminName` char(50) NOT NULL COMMENT '管理员账号',
  `passwd` char(32) NOT NULL COMMENT '管理员密码',
  `addtimes` datetime NOT NULL COMMENT '添加时间',
  `status` int(11) NOT NULL COMMENT '权限状态',
  PRIMARY KEY (`aid`)
) ENGINE=MyISAM AUTO_INCREMENT=13 DEFAULT CHARSET=utf8 COMMENT='管理员表';

-- 正在导出表  youban.admin 的数据：4 rows
/*!40000 ALTER TABLE `admin` DISABLE KEYS */;
INSERT INTO `admin` (`aid`, `adminName`, `passwd`, `addtimes`, `status`) VALUES
	(12, 'Leo', 'e10adc3949ba59abbe56e057f20f883e', '2018-01-25 15:44:14', 1),
	(9, 'Lisa', '25f9e794323b453885f5181f1b624d0b', '2018-01-25 13:22:51', 1),
	(10, 'Mary', 'e10adc3949ba59abbe56e057f20f883e', '2018-01-25 15:26:10', 1),
	(11, 'Meco', '250cf8b51c773f3f8dc8b4be867a9a02', '2018-01-25 15:28:59', 1);
/*!40000 ALTER TABLE `admin` ENABLE KEYS */;

-- 导出  表 youban.tiezi 结构
CREATE TABLE IF NOT EXISTS `tiezi` (
  `tid` int(11) NOT NULL AUTO_INCREMENT COMMENT '帖子表主键',
  `username` char(50) NOT NULL COMMENT '用户名-外键',
  `content` text NOT NULL COMMENT '帖子内容',
  `tzaddtimes` datetime NOT NULL COMMENT '帖子发表时间',
  `status` int(11) NOT NULL DEFAULT '1' COMMENT '删除状态',
  `fatherID` int(11) NOT NULL DEFAULT '0' COMMENT '回复评论id',
  `dznum` int(11) NOT NULL DEFAULT '0' COMMENT '帖子点赞数',
  `picaddress` char(255) NOT NULL COMMENT '帖子图片地址',
  PRIMARY KEY (`tid`)
) ENGINE=MyISAM AUTO_INCREMENT=166 DEFAULT CHARSET=utf8 COMMENT='帖子表';

-- 正在导出表  youban.tiezi 的数据：150 rows
/*!40000 ALTER TABLE `tiezi` DISABLE KEYS */;
INSERT INTO `tiezi` (`tid`, `username`, `content`, `tzaddtimes`, `status`, `fatherID`, `dznum`, `picaddress`) VALUES
	(6, 'Lucy', '我是好人', '2018-01-27 17:34:38', 1, 0, 1, ''),
	(1, 'Mike', '123', '2018-01-26 17:50:57', 1, 0, 1, 'http://192.168.2.182/practice/Youban/upload/image/20180128/1517122818_132555_2017-02-23_23-03-22-000.jpg'),
	(2, 'Mike', 'Hello world', '2018-01-26 18:06:12', 1, 0, 0, ''),
	(8, 'Jack', '是的，你是好人', '2018-01-27 19:01:06', 1, 6, 0, ''),
	(9, 'Jack', '噢我的上帝啊', '2018-01-27 19:01:38', 1, 6, 0, ''),
	(10, 'Alice', '你真可爱！', '2018-01-27 19:02:03', 1, 6, 0, ''),
	(11, 'Lucy', '今天好冷啊', '2018-01-27 19:23:10', 1, 0, 0, ''),
	(160, 'Lucy', '好巧噢，你也网上冲浪啊', '2018-01-31 17:23:48', 1, 158, 0, ''),
	(13, 'Jack', '我真帅！', '2018-01-28 14:30:08', 1, 0, 0, 'http://192.168.2.182/practice/Youban/upload/image/20180128/1517122818_132555_2017-02-23_23-03-22-000.jpg'),
	(15, 'Lucy', '安达市多撒多撒大所阿斯顿撒大声点', '2018-01-29 00:17:18', 1, 0, 3, ''),
	(14, 'Mike', '好神奇', '2018-01-28 15:00:53', 1, 0, 2, 'http://192.168.2.182/practice/Youban/upload/image/20180128/1517122818_132555_2017-02-23_23-03-22-000.jpg'),
	(16, 'Lucy', '小伙伴和我', '2018-01-29 00:29:05', 1, 0, 1, 'http://192.168.2.182/practice/Youban/upload/image/20180129/1517156936_636267_2017-06-02_22-46-27-000.jpg'),
	(17, 'Lucy', '大是的撒阿斯达a', '2018-01-29 11:18:52', 1, 0, 1, ''),
	(18, 'Lucy', '大是的撒阿斯达a', '2018-01-29 11:19:12', 1, 13, 0, ''),
	(19, 'Lucy', '大声点打谁大声点阿斯达啊', '2018-01-29 11:29:40', 1, 13, 0, ''),
	(20, 'Lucy', 'asdasda打的阿斯达打的阿斯达阿斯达阿斯达是的撒的阿斯达按时', '2018-01-29 11:44:49', 1, 0, 5, ''),
	(21, 'Lucy', 'asda啊啊发飞啊啊啊是是', '2018-01-29 12:03:37', 1, 0, 3, ''),
	(22, 'Lucy', '阿斯达打谁大声点撒是', '2018-01-29 12:54:26', 1, 21, 0, ''),
	(23, 'Mike', '我是MiKENIHAO A ', '2018-01-29 14:53:06', 1, 21, 0, ''),
	(24, 'Mike', '是范德萨发师父水电费水电费水电费水电费水电费水电费水电费水电费水电费水电费水电费水电费水电费死的地方水电费死的地方水电费水电费师父啥的', '2018-01-29 15:16:56', 1, 21, 0, ''),
	(25, 'Mike', '我真帅！', '2018-01-29 19:26:01', 1, 0, 2, 'http://192.168.2.182/practice/Youban/upload/image/20180129/1517225150_595688_2017-02-25_20-11-39-000.jpg'),
	(26, 'Mike', 'asd asd asd asd asd asd ad sgdf fh hj gj g', '2018-01-29 20:11:41', 1, 0, 4, 'http://192.168.2.182/practice/Youban/upload/image/20180129/1517227897_127955_2017-07-31_18-47-55-000.jpg'),
	(27, 'Lucy', 'hahhahaha ', '2018-01-29 23:12:28', 1, 6, 0, ''),
	(28, 'Lucy', '我也是噢', '2018-01-29 23:14:14', 1, 6, 0, ''),
	(29, 'Lucy', '你是啥啊', '2018-01-29 23:18:00', 1, 28, 0, ''),
	(30, 'Lucy', '再加一个我！', '2018-01-29 23:20:22', 1, 16, 0, ''),
	(31, 'Lucy', '我在胡言乱语！', '2018-01-29 23:23:24', 1, 20, 0, ''),
	(32, 'Lucy', '哈哈啊哈哈哈哈', '2018-01-29 23:30:53', 1, 21, 0, ''),
	(33, 'Lucy', '吃药啦！', '2018-01-29 23:39:06', 1, 20, 0, ''),
	(34, 'Lucy', '开心!', '2018-01-29 23:39:57', 1, 20, 0, ''),
	(35, 'Lucy', 'hahhahahah', '2018-01-29 23:41:31', 1, 20, 0, ''),
	(36, 'Mike', '我也觉得！！', '2018-01-29 23:44:36', 1, 25, 0, ''),
	(37, 'Mike', '西域来的', '2018-01-29 23:45:30', 1, 26, 0, ''),
	(38, 'Mike', '是的啊', '2018-01-29 23:51:41', 1, 14, 0, ''),
	(39, 'Mike', '456', '2018-01-29 23:51:59', 1, 1, 0, ''),
	(40, 'Mike', '789', '2018-01-29 23:52:30', 1, 1, 0, ''),
	(41, 'Mike', '帅气！', '2018-01-29 23:53:17', 1, 14, 0, ''),
	(42, 'Mike', 'dadasd阿斯达阿达', '2018-01-29 23:54:10', 1, 26, 0, ''),
	(43, 'Mike', '帅气啊', '2018-01-29 23:59:55', 1, 26, 0, ''),
	(44, 'Mike', '说是生生世世时候上市啊', '2018-01-30 00:00:07', 1, 21, 0, ''),
	(45, 'Mike', '今晚是个好天气！', '2018-01-30 00:01:12', 1, 0, 28023, 'http://192.168.2.182/practice/Youban/upload/image/20180130/1517241669_729431_2017-05-13_22-26-01-000.jpg'),
	(46, 'Mike', '雪景真好看', '2018-01-30 00:41:25', 1, 25, 0, ''),
	(47, 'Mike', '我也觉得！', '2018-01-30 09:07:10', 1, 45, 0, ''),
	(48, 'Mike', '是的！', '2018-01-30 09:07:48', 1, 45, 0, ''),
	(49, 'Mike', '哈哈哈哈啊哈哈', '2018-01-30 10:05:51', 1, 45, 0, ''),
	(50, 'Mike', '111111', '2018-01-30 10:08:10', 1, 1, 0, ''),
	(51, 'Mike', '这是哪儿啊', '2018-01-30 10:08:40', 1, 14, 0, ''),
	(52, 'Mike', '嘻嘻', '2018-01-30 10:10:44', 1, 14, 0, ''),
	(53, 'Mike', '哈哈哈哈', '2018-01-30 10:11:31', 1, 14, 0, ''),
	(54, 'Jack', '嘻嘻', '2018-01-30 10:42:09', 1, 26, 0, ''),
	(55, 'Lucy', '雪真好看', '2018-01-30 10:51:43', 1, 45, 0, ''),
	(56, 'Lucy', '哈哈哈哈哈哈哈', '2018-01-30 10:51:50', 1, 45, 0, ''),
	(57, 'Lucy', '哈哈哈哈哈哈', '2018-01-30 14:13:05', 1, 21, 0, ''),
	(58, 'Lucy', '哈哈啊哈哈哈哈', '2018-01-30 18:56:36', 1, 21, 0, ''),
	(59, 'Mike', '今天是第三天！加油啊！', '2018-01-30 21:58:22', 1, 0, 4, 'http://192.168.2.182/practice/Youban/upload/image/20180130/1517320685_424766_2017-10-16_23-10-42-000.jpg'),
	(60, 'Mike', '真漂亮！', '2018-01-30 22:05:26', 1, 59, 0, ''),
	(61, 'Mike', '康撒哈米达！', '2018-01-30 22:06:41', 1, 17, 0, ''),
	(62, 'Mike', '妈妈和儿子！', '2018-01-30 22:11:52', 1, 59, 0, ''),
	(63, 'Mike', '军娘真好看！', '2018-01-30 22:12:24', 1, 59, 0, ''),
	(68, '145@qq.com', '哈哈哈哈', '2018-01-31 01:22:38', 1, 45, 0, ''),
	(67, '145@qq.com', '大晚上不睡觉！', '2018-01-31 01:20:31', 1, 59, 0, ''),
	(73, 'Mike', '哈哈', '2018-01-31 09:34:03', 1, 59, 0, ''),
	(72, 'Mike', '嘻嘻', '2018-01-31 09:30:07', 1, 59, 0, ''),
	(74, 'Mike', '啦啦啦', '2018-01-31 09:39:20', 1, 59, 0, ''),
	(75, 'Mike', '哈哈哈', '2018-01-31 09:52:15', 1, 59, 0, ''),
	(76, 'Mike', '1111', '2018-01-31 09:52:46', 1, 59, 0, ''),
	(77, 'Lucy', '今天是个好日子！', '2018-01-31 12:43:26', 1, 0, 4, 'http://192.168.2.182/practice/Youban/upload/image/20180131/1517373800_738382_2017-05-20_15-55-21-000.jpg'),
	(78, 'Lucy', '哈哈哈', '2018-01-31 12:43:37', 1, 77, 0, ''),
	(79, 'Lucy', '嘿嘿', '2018-01-31 13:10:57', 1, 77, 0, ''),
	(83, '750273017@qq.com', '给你们看一张图片', '2018-01-31 13:24:45', 1, 0, 5, 'http://192.168.2.182/practice/Youban/upload/image/20180131/1517376269_126190_fmbg1.jpg'),
	(81, 'Mike', '哈哈', '2018-01-31 13:12:43', 1, 59, 0, ''),
	(82, '750273017@qq.com', '哈哈哈哈哈今天吃的真饱', '2018-01-31 13:23:32', 1, 0, 3, ''),
	(84, '750273017@qq.com', '哈哈哈哈', '2018-01-31 13:25:23', 1, 83, 0, ''),
	(85, 'Mike', '哈哈哈哈啊哈哈', '2018-01-31 13:37:27', 1, 0, 6, 'http://192.168.2.182/practice/Youban/upload/image/20180131/1517377034_117627_2017-02-24_20-53-47-000.jpg'),
	(86, 'Mike', 'heihei', '2018-01-31 13:45:40', 1, 85, 0, ''),
	(87, '750273017@qq.com', '哈哈啊', '2018-01-31 13:45:51', 1, 17, 0, ''),
	(88, '750273017@qq.com', '很有感觉哦', '2018-01-31 13:46:21', 1, 83, 0, ''),
	(89, '750273017@qq.com', '哈哈', '2018-01-31 13:47:31', 1, 82, 0, ''),
	(90, 'Mike', '呃呃呃', '2018-01-31 13:49:45', 1, 59, 0, ''),
	(91, 'Mike', '哈哈哈哈', '2018-01-31 13:56:01', 1, 85, 0, ''),
	(92, 'Mike', '哈哈', '2018-01-31 13:56:35', 1, 85, 0, ''),
	(93, '750273017@qq.com', '你才是啊！', '2018-01-31 14:03:14', 1, 83, 0, ''),
	(94, 'Mike', '嘿嘿', '2018-01-31 14:03:30', 1, 85, 0, ''),
	(95, 'Lucy', '略略略', '2018-01-31 14:04:06', 1, 77, 0, ''),
	(96, 'Mike', '嘻嘻', '2018-01-31 14:04:13', 1, 59, 0, ''),
	(97, '750273017@qq.com', '嗯嗯', '2018-01-31 14:04:37', 1, 26, 0, ''),
	(98, '750273017@qq.com', '谔谔', '2018-01-31 14:04:51', 1, 25, 0, ''),
	(99, '750273017@qq.com', '二维玩', '2018-01-31 14:04:57', 1, 21, 0, ''),
	(100, 'Lucy', '好吗？', '2018-01-31 14:05:01', 1, 77, 0, ''),
	(101, '750273017@qq.com', '都是十分水电费', '2018-01-31 14:05:23', 1, 20, 0, ''),
	(102, '750273017@qq.com', '水电费第三方士大夫是打发第三方的范德萨范德萨发的发的', '2018-01-31 14:05:30', 1, 20, 0, ''),
	(103, '750273017@qq.com', '的说法是电风扇大城市的房产税的发送答案发送到发送到发送到发送到发送到', '2018-01-31 14:05:39', 1, 17, 0, ''),
	(104, '750273017@qq.com', '的说法是电风扇大城市的房产税的发送答案发送到发送到发送到发送到发送到的说法是电风扇大城市的房产税的发送答案发送到发送到发送到发送到发送到的说法是电风扇大城市的房产税的发送答案发送到发送到发送到发送到发送到的说法是电风扇大城市的房产税的发送答案发送到发送到发送到发送到发送到的说法是电风扇大城市的房产税的发送答案发送到发送到发送到发送到发送到的说法是电风扇大城市的房产税的发送答案发送到发送到发送到发送到发送到的说法是电风扇大城市的房产税的发送答案发送到发送到发送到发送到发送到', '2018-01-31 14:05:50', 1, 17, 0, ''),
	(105, '1192219816@qq.com', '有伴儿，想和你永远做个伴儿', '2018-01-31 14:06:06', 1, 0, 4, ''),
	(106, '750273017@qq.com', '第三方对方水电费水电费水电费水电费水电费水电费水电费水电费水电费水电费胜多负少的', '2018-01-31 14:06:21', 1, 11, 0, ''),
	(107, '750273017@qq.com', '弟弟', '2018-01-31 14:06:51', 1, 83, 0, ''),
	(108, '750273017@qq.com', '嘻嘻', '2018-01-31 14:08:06', 1, 83, 0, ''),
	(109, '750273017@qq.com', '哈哈哈', '2018-01-31 14:08:38', 1, 83, 0, ''),
	(110, '750273017@qq.com', '哈哈哈', '2018-01-31 14:10:01', 1, 105, 0, ''),
	(111, '750273017@qq.com', '哈哈哈', '2018-01-31 14:10:16', 1, 85, 0, ''),
	(112, 'Mike', '嘻嘻', '2018-01-31 14:11:23', 1, 83, 0, ''),
	(115, '1192219816@qq.com', '1111', '2018-01-31 14:18:23', 1, 0, 2, 'http://192.168.2.182/practice/Youban/upload/image/20180131/1517379495_651458_7c1ed21b0ef41bd51b2dc86a5bda81cb39db3d35.jpg'),
	(164, 'Mike', '哈哈哈真的吗！', '2018-01-31 19:07:18', 1, 82, 0, ''),
	(163, 'Mike', '哈哈哈哈哈哈', '2018-01-31 19:06:09', 1, 0, 0, ''),
	(118, '750273017@qq.com', '的', '2018-01-31 14:22:47', 1, 83, 0, ''),
	(119, '750273017@qq.com', '2333', '2018-01-31 14:23:09', 1, 82, 0, ''),
	(114, '750273017@qq.com', 'DASDSDS', '2018-01-31 14:17:07', 1, 6, 0, ''),
	(120, 'Mike', '哈哈哈哈哈', '2018-01-31 14:23:59', 1, 115, 0, ''),
	(121, '750273017@qq.com', '飞飞飞', '2018-01-31 14:24:11', 1, 115, 0, ''),
	(122, '750273017@qq.com', '2333', '2018-01-31 14:24:22', 1, 83, 0, ''),
	(123, '1334855187@qq.com', '路过', '2018-01-31 14:25:14', 1, 0, 5, 'http://192.168.2.182/practice/Youban/upload/image/20180131/1517379910_110518_1.jpg'),
	(124, '1192219816@qq.com', '记得一直来', '2018-01-31 14:25:56', 1, 123, 0, ''),
	(125, '1334855187@qq.com', '123', '2018-01-31 14:25:57', 1, 123, 0, ''),
	(126, '750273017@qq.com', '嘿嘿嘿', '2018-01-31 14:26:02', 1, 123, 0, ''),
	(127, '1334855187@qq.com', '谁这么挫', '2018-01-31 14:27:02', 1, 115, 0, ''),
	(128, '1334855187@qq.com', '买个服务器就可以一直来了', '2018-01-31 14:28:15', 1, 123, 0, ''),
	(129, 'Mike', '嘻嘻', '2018-01-31 14:28:29', 1, 85, 0, ''),
	(130, '750273017@qq.com', '2333333', '2018-01-31 14:30:00', 1, 82, 0, ''),
	(131, '750273017@qq.com', '来呀来呀', '2018-01-31 14:30:40', 1, 105, 0, ''),
	(132, '750273017@qq.com', '心想的事儿都能成', '2018-01-31 14:31:13', 1, 77, 0, ''),
	(133, '750273017@qq.com', '嘿嘿嘿', '2018-01-31 14:31:30', 1, 83, 0, ''),
	(134, '1334855187@qq.com', '孔晓慧路过', '2018-01-31 14:32:01', 1, 0, 3, 'http://192.168.2.182/practice/Youban/upload/image/20180131/1517380319_265635_9.jpg'),
	(135, '750273017@qq.com', '冬眠啦冬眠啦！！！', '2018-01-31 14:32:35', 1, 0, 1, 'http://192.168.2.182/practice/Youban/upload/image/20180131/1517380342_370804_banner13.png'),
	(136, '1334855187@qq.com', '蔡芬来了', '2018-01-31 14:32:48', 1, 0, 1, 'http://192.168.2.182/practice/Youban/upload/image/20180131/1517380365_163133_10.jpg'),
	(137, '750273017@qq.com', '哇~这个发型真好看', '2018-01-31 14:33:01', 1, 134, 0, ''),
	(138, '1192219816@qq.com', '长得真像', '2018-01-31 14:33:09', 1, 134, 0, ''),
	(139, '750273017@qq.com', '黑珍珠怎么变绿珍珠了', '2018-01-31 14:33:34', 1, 136, 0, ''),
	(140, '1334855187@qq.com', '被绿了', '2018-01-31 14:34:34', 1, 136, 0, ''),
	(141, '750273017@qq.com', '分享图片', '2018-01-31 14:43:30', 1, 0, 0, 'http://192.168.2.182/practice/Youban/upload/image/20180131/1517380993_112911_fmbg7.jpg'),
	(142, '1192219816@qq.com', '  ', '2018-01-31 14:44:01', 1, 0, 0, 'http://192.168.2.182/practice/Youban/upload/image/20180131/1517381030_725085_41.jpg'),
	(143, '750273017@qq.com', '再分享一张', '2018-01-31 14:44:14', 1, 0, 2, 'http://192.168.2.182/practice/Youban/upload/image/20180131/1517381052_521588_banner16.png'),
	(144, '1192219816@qq.com', '    ', '2018-01-31 14:45:02', 1, 0, 1, 'http://192.168.2.182/practice/Youban/upload/image/20180131/1517381094_499771_2.jpg'),
	(145, '750273017@qq.com', '嘿嘿', '2018-01-31 14:45:27', 1, 17, 0, ''),
	(146, '1192219816@qq.com', '111', '2018-01-31 14:46:00', 1, 143, 0, ''),
	(147, 'Mike', '哈哈哈', '2018-01-31 14:47:27', 1, 16, 0, ''),
	(148, '750273017@qq.com', '嘿嘿', '2018-01-31 14:47:51', 1, 16, 0, ''),
	(149, '123456@qq.com', '今天星期三！', '2018-01-31 15:13:10', 1, 0, 1, 'http://192.168.2.182/practice/Youban/upload/image/20180131/1517382782_442667_2017-02-26_23-18-51-000.jpg'),
	(150, '123456@qq.com', '好帅！', '2018-01-31 15:13:37', 1, 149, 0, ''),
	(151, '123456@qq.com', '哈哈哈哈', '2018-01-31 15:14:24', 1, 149, 0, ''),
	(152, '123456@qq.com', '楼上是好学生！', '2018-01-31 15:14:57', 1, 83, 0, ''),
	(153, '123456@qq.com', '好看', '2018-01-31 15:15:57', 1, 141, 0, ''),
	(154, '123456@qq.com', '哈哈哈', '2018-01-31 15:21:18', 1, 149, 0, ''),
	(155, '750273017@qq.com', '我们的生活', '2018-01-31 17:09:00', 1, 149, 0, ''),
	(156, '750273017@qq.com', '你好呀', '2018-01-31 17:10:15', 1, 0, 2, ''),
	(157, '750273017@qq.com', '嘿嘿我在手机上登陆', '2018-01-31 17:10:36', 1, 156, 0, ''),
	(158, '1192219816@qq.com', '有伴儿，我来啦', '2018-01-31 17:13:10', 1, 0, 1, ''),
	(159, '750273017@qq.com', '嘿嘿哈哈', '2018-01-31 17:15:45', 1, 12, 0, ''),
	(161, 'Lucy', '楼下是撒比', '2018-01-31 17:24:17', 1, 156, 0, ''),
	(162, 'Lucy', '无敌哈哈哈哈哈', '2018-01-31 17:28:31', 1, 77, 0, ''),
	(165, '750273018@qq.com', '你看我的头像可不可爱', '2018-01-31 19:33:03', 1, 0, 0, '');
/*!40000 ALTER TABLE `tiezi` ENABLE KEYS */;

-- 导出  表 youban.user 结构
CREATE TABLE IF NOT EXISTS `user` (
  `uid` int(11) NOT NULL AUTO_INCREMENT,
  `username` char(50) NOT NULL COMMENT '用户账号',
  `realname` char(50) NOT NULL DEFAULT '保密' COMMENT '用户真实姓名',
  `emotional` char(50) NOT NULL DEFAULT '保密' COMMENT '用户感情状态',
  `email` char(50) NOT NULL DEFAULT '保密' COMMENT '用户邮箱',
  `mark` char(50) NOT NULL DEFAULT '无' COMMENT '用户标签',
  `job` char(50) NOT NULL DEFAULT '保密' COMMENT '用户职业',
  `address` char(50) NOT NULL DEFAULT '保密' COMMENT '用户住址',
  `passwd` char(50) NOT NULL COMMENT '用户密码',
  `regtimes` datetime NOT NULL COMMENT '注册时间',
  `tel` char(50) DEFAULT NULL COMMENT '用户联系方式',
  `birthday` char(200) DEFAULT NULL COMMENT '用户生日',
  `hobby` char(200) DEFAULT NULL COMMENT '用户爱好',
  `sex` tinyint(4) NOT NULL DEFAULT '1' COMMENT '用户性别',
  `status` tinyint(4) NOT NULL DEFAULT '1' COMMENT '注销状态',
  `nickname` char(50) DEFAULT '' COMMENT '昵称',
  `ownsign` text COMMENT '个性签名',
  `headpic` char(200) NOT NULL DEFAULT '123' COMMENT '头像地址',
  PRIMARY KEY (`uid`)
) ENGINE=MyISAM AUTO_INCREMENT=35 DEFAULT CHARSET=utf8 COMMENT='用户表';

-- 正在导出表  youban.user 的数据：20 rows
/*!40000 ALTER TABLE `user` DISABLE KEYS */;
INSERT INTO `user` (`uid`, `username`, `realname`, `emotional`, `email`, `mark`, `job`, `address`, `passwd`, `regtimes`, `tel`, `birthday`, `hobby`, `sex`, `status`, `nickname`, `ownsign`, `headpic`) VALUES
	(4, 'Jack', '保密', '保密', '保密', '无', '保密', '保密', 'e10adc3949ba59abbe56e057f20f883e', '2018-01-25 20:16:14', NULL, NULL, NULL, 1, 1, '五五开', '我命由我不由天', 'http://192.168.2.182/practice/Youban/mainlost/img/3.jpg'),
	(2, 'Mike', '保密', '已婚', '保密', '无', '保密', '保密', 'e10adc3949ba59abbe56e057f20f883e', '2018-01-25 20:09:22', '110', '1964-5-5', NULL, 1, 1, '洛晨', '尘创造总比毁灭有趣', 'http://192.168.2.182/practice/Youban/upload/image/20180130/1517320685_424766_2017-10-16_23-10-42-000.jpg'),
	(3, 'Alice', '保密', '保密', '保密', '无', '保密', '保密', 'e10adc3949ba59abbe56e057f20f883e', '2018-01-25 20:13:44', NULL, NULL, NULL, 1, 1, '洛晨', '我命由我不由天', ''),
	(5, 'Pasa', '保密', '保密', '保密', '无', '保密', '保密', 'e10adc3949ba59abbe56e057f20f883e', '2018-01-25 22:10:41', NULL, NULL, NULL, 1, 1, '洛晨', '我命由我不由天', ''),
	(6, 'Nick', '保密', '保密', '保密', '无', '保密', '保密', 'e10adc3949ba59abbe56e057f20f883e', '2018-01-25 22:29:43', NULL, NULL, NULL, 1, 1, '洛晨', '我命由我不由天', ''),
	(7, 'Lucy', 'Nike', '单身待解救', '123@qq.com', '乐观，开朗', '前端开发工程师', '黑龙江-绥化', 'e10adc3949ba59abbe56e057f20f883e', '2018-01-26 15:58:07', '120', '1990-5-29', '吃饭饭', 1, 1, '李皓天', '哈哈哈哈', 'http://192.168.2.182/practice/Youban/upload/image/20180129/1517156650_883614_2017-04-12_20-51-18-002.jpg'),
	(34, '750273018@qq.com', '保密', '保密', '保密', '无', '保密', '保密', 'e10adc3949ba59abbe56e057f20f883e', '2018-01-31 19:32:45', '15178915337', '1996年4月1日', '嘿嘿你猜', 2, 1, '我曾这样执拗', '我就是我不一样的烟火', 'http://192.168.2.182/practice/Youban/mainlost/img/9.jpg'),
	(15, '123@qq.com', '华清远见+', '已婚', '110@qq.com', '学员', '前端开发', '保密', 'e10adc3949ba59abbe56e057f20f883e', '2018-01-29 15:37:47', '18225694236', '1996年5月12日', '打lol', 2, 1, '华小见', '嘻嘻', ''),
	(16, '456@qq.com', '保密', '保密', '保密', '无', '保密', '保密', '25f9e794323b453885f5181f1b624d0b', '2018-01-29 15:41:00', '18227592890', '1995年7月17日', '打lol', 1, 1, '草莓', '上Miss！', ''),
	(17, '789@qq.com', '保密', '保密', '保密', '无', '保密', '保密', 'e10adc3949ba59abbe56e057f20f883e', '2018-01-29 15:42:43', '18227592890', '1995年7月13日', '打lol', 1, 1, 'Uzi', 'VN不ban，你们就完！', ''),
	(18, 'Leo@qq.com', '保密', '保密', '保密', '无', '保密', '保密', 'e10adc3949ba59abbe56e057f20f883e', '2018-01-31 00:52:31', '17545596502', '1996年9月1日', '吃饭', 1, 1, '小可爱', '我开心就好', 'http://192.168.2.182/PHP/youban/upload/image/20180131/1517331098_845015_2017-08-23_22-49-24-000.jpg'),
	(19, '145@qq.com', '保密', '保密', '保密', '无', '保密', '保密', 'e10adc3949ba59abbe56e057f20f883e', '2018-01-31 01:02:35', '17545596502', '1998年8月19日', '打lol', 1, 1, '若风', '中路杀神！', 'http://192.168.2.182/practice/Youban/upload/image/20180131/1517331751_119546_2017-06-13_22-06-06-000.jpg'),
	(20, '392375350@qq.com', '保密', '保密', '保密', '无', '保密', '保密', 'e10adc3949ba59abbe56e057f20f883e', '2018-01-31 12:47:55', '18349156226', '1994年8月17日', '可多了', 1, 1, '辉哥神武', '细节决定成败！', 'http://192.168.2.182/practice/Youban/upload/image/20180131/1517374071_819196_2017-06-13_22-08-53-000.jpg'),
	(22, '123654@qq.com', '保密', '已婚', '保密', '无', '保密', '保密', 'e10adc3949ba59abbe56e057f20f883e', '2018-01-31 13:11:54', '18227592890', '1995年11月27日', '嘻嘻', 1, 1, '智障', '哈哈嘻嘻', 'http://192.168.2.182/practice/Youban/mainlost/img/6.jpg'),
	(24, '750273017@qq.com', '你猜', '已婚', '750273017@qq.com', '青春无敌美少女', '无业游民', '重庆-开县', 'e10adc3949ba59abbe56e057f20f883e', '2018-01-31 13:23:07', '15178915336', '1996-5-17', '吃玩睡觉', 2, 1, '你是小傻逼', '我是小可爱', 'http://192.168.2.182/practice/Youban/upload/image/20180131/1517376181_139298_f62c-fypikwt3265383.jpg'),
	(25, '1192219816@qq.com', '保密', '保密', '保密', '无', '保密', '保密', 'e10adc3949ba59abbe56e057f20f883e', '2018-01-31 13:25:03', '13890732960', '1992年10月18日', '吃东西', 2, 1, 'Miss', '开心就好！', 'http://192.168.2.182/practice/Youban/mainlost/img/7.jpg'),
	(26, '1334855187@qq.com', '保密', '保密', '保密', '无', '保密', '保密', '33ceb07bf4eeb3da587e268d663aba1a', '2018-01-31 14:23:51', '18483672946', '2018年1月1日', '敲代码', 1, 1, '苟洁', '敲代码。。。', 'http://192.168.2.182/practice/Youban/upload/image/20180131/1517379828_112196_2.jpg'),
	(27, '123456@qq.com', '华清远见', '已婚', '110@qq.com', '学员', '前端开发', '四川-成都', 'e10adc3949ba59abbe56e057f20f883e', '2018-01-31 15:12:27', '18225694236', '2000-4-1', '写代码！', 1, 1, '华小见', '嘻嘻', 'http://192.168.2.182/practice/Youban/upload/image/20180131/1517382734_683516_2017-04-16_13-15-05-000.jpg'),
	(33, '123888@qq.com', '保密', '保密', '保密', '无', '保密', '保密', 'e10adc3949ba59abbe56e057f20f883e', '2018-01-31 16:48:08', '17545596502', '1998年6月18日', '嘻嘻', 1, 1, '路白晨', '哈哈哈', 'http://192.168.2.182/practice/Youban/upload/image/20180131/1517388100_720610_2016-08-04_23-24-22-000.jpg'),
	(32, '123789@qq.com', '保密', '保密', '保密', '无', '保密', '保密', 'e10adc3949ba59abbe56e057f20f883e', '2018-01-31 16:45:34', '17545596502', '1998年6月18日', '嘻嘻', 1, 1, '路白晨', '哈哈哈', 'http://192.168.2.182/practice/Youban/upload/image/20180131/1517388100_720610_2016-08-04_23-24-22-000.jpg');
/*!40000 ALTER TABLE `user` ENABLE KEYS */;

/*!40101 SET SQL_MODE=IFNULL(@OLD_SQL_MODE, '') */;
/*!40014 SET FOREIGN_KEY_CHECKS=IF(@OLD_FOREIGN_KEY_CHECKS IS NULL, 1, @OLD_FOREIGN_KEY_CHECKS) */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
